Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>гф_ПродукцияВКоробах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ХозяйственныеОперации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеТоваровПоТребованию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЧерезКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаПоИмпорту</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуРеглУчет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтРозничногоПокупателя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровЧерезКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровОтКлиента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтХранителя</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщикаФактуровкаПоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаПоИмпортуТоварыВПути</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаУПоставщикаТоварыВПути</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаВСтранахЕАЭСТоварыВПути</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// #wortmann {
	// Галфинд Sakovich 2022/12/11
	гф_УстановитьПризнакЗаказатьКМ(Отказ, РежимЗаписи)
	// } #wortmann
КонецПроцедуры

&После("ПриКопировании")
Процедура гф_ПриКопировании(ОбъектКопирования)
	// #wortmann {
	// Галфинд Sakovich 2022/12/11
	гф_ЗаказатьКМ = Ложь;
	гф_КМЭмитированы = Ложь;
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура гф_ПересчитатьТЧТоварыНаОсновнииКоробов() Экспорт
	
	ВременнаяТаблицаТовары = Товары.Выгрузить();
	
	ВременнаяТаблицаТовары.Очистить();
	
	Для каждого СтрокаВКоробах из гф_ПродукцияВКоробах Цикл
		
		Если ЗначениеЗаполнено(СтрокаВКоробах.IDКороба) Тогда
			
			гф_ДобавитьСтрокиПоУпаковочномуЛисту(СтрокаВКоробах, ВременнаяТаблицаТовары);
			
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаВКоробах.ВариантКомплектации) Тогда 
			
			гф_ДобавитьСтрокиПоВариантуКомплектации(СтрокаВКоробах, ВременнаяТаблицаТовары);
			
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	ВременнаяТаблицаТовары.Свернуть("Номенклатура, Характеристика, Назначение, Упаковка, Цена",
	"КоличествоУпаковок, Количество, Сумма");
	
	Товары.Загрузить(ВременнаяТаблицаТовары);
	
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, Ложь, Товары, Истина);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	
	СтруктураДействий = Новый Структура; 
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", 
		ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект, Истина));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
	
КонецПроцедуры

Процедура гф_ДобавитьСтрокиПоУпаковочномуЛисту(СтрокаВКоробах, ВременнаяТаблицаТовары)
	
	РабочаяТаблица = Товары.Выгрузить();
	РабочаяТаблица.Очистить();
	
	Для каждого Строка из СтрокаВКоробах.IDКороба.Товары Цикл	
		
		НоваяСтрокаРТ = РабочаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРТ, Строка);
		
		НоваяСтрокаРТ.Количество = ?(СтрокаВКоробах["КоличествоКоробов"] =  0, 
		НоваяСтрокаРТ.Количество, НоваяСтрокаРТ.Количество * СтрокаВКоробах["КоличествоКоробов"]);
		НоваяСтрокаРТ.КоличествоУпаковок = ?(СтрокаВКоробах["КоличествоКоробов"] =  0, 
		НоваяСтрокаРТ.КоличествоУпаковок, НоваяСтрокаРТ.КоличествоУпаковок * СтрокаВКоробах["КоличествоКоробов"]);
		
	КонецЦикла;
	
	ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СтрокаВКоробах.СтоимостьКороба * 
	?(СтрокаВКоробах["КоличествоКоробов"] =  0, 1, СтрокаВКоробах["КоличествоКоробов"] ), РабочаяТаблица, "Сумма", "КоличествоУпаковок");
	
	Для каждого Строка из РабочаяТаблица Цикл
		
		НоваяСтрока = ВременнаяТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.Цена = ?(НоваяСтрока.КоличествоУпаковок = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок);
		
		Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура гф_ДобавитьСтрокиПоВариантуКомплектации(СтрокаВКоробах, ВременнаяТаблицаТовары)
	
	РабочаяТаблица = Товары.Выгрузить();
	РабочаяТаблица.Очистить();
	
	Для каждого Строка из СтрокаВКоробах.ВариантКомплектации.Товары Цикл
		
		НоваяСтрокаРТ = РабочаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРТ, Строка);
		
		НоваяСтрокаРТ.Количество = ?(СтрокаВКоробах["КоличествоКоробов"] =  0, 
		НоваяСтрокаРТ.Количество, НоваяСтрокаРТ.Количество * СтрокаВКоробах["КоличествоКоробов"]);
		НоваяСтрокаРТ.КоличествоУпаковок = ?(СтрокаВКоробах["КоличествоКоробов"] =  0, 
		НоваяСтрокаРТ.КоличествоУпаковок, НоваяСтрокаРТ.КоличествоУпаковок * СтрокаВКоробах["КоличествоКоробов"]);
		
		НоваяСтрокаРТ.Назначение = Справочники.Назначения.гф_Техническое;
		
	КонецЦикла;
	
	ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СтрокаВКоробах.СтоимостьКороба * 
	?(СтрокаВКоробах["КоличествоКоробов"] =  0, 1, СтрокаВКоробах["КоличествоКоробов"] ), РабочаяТаблица, "Сумма", "Количество");
	
	Для каждого Строка из РабочаяТаблица Цикл
		
		НоваяСтрока = ВременнаяТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);
		
		Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура гф_УстановитьПризнакЗаказатьКМ(Отказ, РежимЗаписи)
	
	Если Не (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту) Тогда
		Возврат;
	КонецЕсли;
	тзТовары = Товары.Выгрузить();
	Если Не Документы.ПриобретениеТоваровУслуг.гф_ОпределитьНаличиеМаркируемойПродукции(тзТовары) Тогда
		Возврат;
	КонецЕсли;
	
	гф_ЗаказатьКМ = Истина;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
